outputs/azure/Loadbalancer/nginx/10000/ab_metrics7.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 51.120.122.67 (be patient)


Server Software:        nginx/1.29.2
Server Hostname:        51.120.122.67
Server Port:            80

Document Path:          /
Document Length:        21 bytes

Concurrency Level:      10
Time taken for tests:   6.099 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2630000 bytes
HTML transferred:       210000 bytes
Requests per second:    1639.74 [#/sec] (mean)
Time per request:       6.099 [ms] (mean)
Time per request:       0.610 [ms] (mean, across all concurrent requests)
Transfer rate:          421.14 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.2      1      47
Processing:     2    5   2.5      4      52
Waiting:        2    5   2.5      4      52
Total:          3    6   2.9      5      54

Percentage of the requests served within a certain time (ms)
  50%      5
  66%      6
  75%      7
  80%      7
  90%      8
  95%     10
  98%     14
  99%     18
 100%     54 (longest request)